import random
from rich import print
import time

HAPPY_FACES = [
    '(´・ω・｀)',
    '( ´･ω･)',
    '( ´･ω･)人(・ω・｀ )',
    '(｀･ω･)ﾉ☆･ﾟ::ﾟ',
    '(｡´・ω・｀｡)',
    '（*＾ワ＾*）',
    '(๑꧆◡꧆๑)',
    'ヾ(＠^∇^＠)ノ',
    'o(〃＾▽＾〃)o',
    '(✧Д✧) YES!!',
    'ヽ(＾Д＾)ﾉ',
    '（｡>‿‿<｡ ）',
    '(〃 ω 〃)',
    '(🖒^_^)🖒',
    ' (☆｀• ω •´)ｂ',
    '( ͡° ͜ʖ ͡°)',
    '|ω・)'
]
SAD_FACES = [
    '(´；д；`)',
    '(　；∀；)',
    '(´；ω；`)',
    '(ಥ‿ಥ)',
    '(╥﹏╥)',
    '(ㄒoㄒ)',
    'o(TヘTo)',
    '（┬┬＿┬┬）',
    '(´；д；)',
    'щ(ﾟДﾟщ)',
    'ヽ(`д´；)/',
    'ヽ(*｀ﾟД´)ﾉ',
    '┗(｀ﾟДﾟ´)┛',
    'Σ(＝д＝)',
    '( ͠° ͟ʖ ͠°)'
]

TABLE_ANIM = {
    'step': 1,
    'frames': [
        " (ヘ･_･)ヘ┳━┳     ",
        " (┛°Д°)┛︵┻━┻     ",
    ]
}
LENNY_ANIM = {
    'step': 1,
    'frames': [
        ' ( ͡° ͜ʖ ͡°)>⌐■-■    ',
        ' ( ͡⌐■ ͜ʖ ͡-■)       '
    ]
}
DENKO_ANIM = {
    'step': 0.2,
    'frames': [
        ' |           ',
        ' |           ',
        ' |           ',
        ' |･`)        ',
        ' |ω･`)        ',
        ' |ω・`)       ',
        ' │・ω・`)     ',
        ' |(´・ω・｀)  ',
        ' |(´・ω・｀)  ',
        ' |(´・ω・｀)  ',
        ' |(´・ω・｀)  ',
        ' |(´・ω・｀)  ',
        ' │・ω・`)     ',
        ' |ω・`)       ',
        ' |ω･`)        ',
        ' |･`)         ',
        ' |･`)         ',
        ' |･`)         ',
        ' |           ',
        ' |           ',
        ' |           ',
    ]
}
FLY_ANIM = {
    'step': 0.1,
    'frames': [
        '                       ',
        ' つ                    ',
        ' )つ                   ',
        ' •́)つ                  ',
        ' ω•́)つ                 ',
        ' •̀ω•́)つ                ',
        ' つ•̀ω•́)つ              ',
        '  つ•̀ω•́)つ             ',
        ' ( つ•̀ω•́)つ            ',
        ' (( つ•̀ω•́)つ           ',
        ' ((( つ•̀ω•́)つ          ',
        ' Σ((( つ•̀ω•́)つ         ',
        ' ≡Σ((( つ•̀ω•́)つ        ',
        ' =≡Σ((( つ•̀ω•́)つ       ',
        ' ─=≡Σ((( つ•̀ω•́)つ      ',
        '  ─=≡Σ((( つ•̀ω•́)つ     ',
        '   ─=≡Σ((( つ•̀ω•́)つ    ',
        '    ─=≡Σ((( つ•̀ω•́)つ   ',
        '     ─=≡Σ((( つ•̀ω•́)つ  ',
        '      ─=≡Σ((( つ•̀ω•́)つ ',
        '       ─=≡Σ((( つ•̀ω•́)  ',
        '        ─=≡Σ((( つ•̀ω•́  ',
        '         ─=≡Σ((( つ•̀ω  ',
        '          ─=≡Σ((( つ•̀  ',
        '           ─=≡Σ((( つ  ',
        '            ─=≡Σ(((    ',
        '             ─=≡Σ(((   ',
        '              ─=≡Σ((   ',
        '               ─=≡Σ(   ',
        '                ─=≡Σ   ',
        '                 ─=≡   ',
        '                  ─=   ',
        '                   ─   ',
        '                       ',
    ]
}
PUNCH_ANIM = {
    'step': 1,
    'frames': [
        ' (●｀・ω・) (´・ω・｀) ',
        ' (●｀・ω・)=●)｀-д゜) '
    ]
}

def success(message: str = ''):
    print(f'{random.choice(HAPPY_FACES)} {message}')

def failure(message: str = ''):
    print(f'{random.choice(SAD_FACES)} {message}')

def wait(seconds: int):
    animation = random.choice([TABLE_ANIM, DENKO_ANIM, LENNY_ANIM, FLY_ANIM, PUNCH_ANIM])
    step, frames = animation['step'], animation['frames']
    i = 0
    elapsed = 0
    while elapsed <= seconds:
        print(frames[i % len(frames)], end="\r")
        time.sleep(step)
        i += 1
        elapsed += step
    print('                       ', end="\r")